In [3]:
import pandas as pd
import sqlite3

In [1]:
csv_file = r'G04_Movie_Database.csv'
db_file = "data\\base.db"

In [4]:
df = pd.read_csv(csv_file)    
conn = sqlite3.connect(db_file)

In [19]:
df_actors = df[['actors_id', 'name', 'birthdate', 'nationality']].drop_duplicates()
df_actors = df_actors.rename(columns={'actors_id':'id'})
df_actors.to_sql('Actors', conn, if_exists='append', index=False)

    id              name   birthdate nationality
0  356    Steven Johnson  1996-07-02      Canada
1   94     Eric Anderson  1982-05-05         USA
2   52  Christine Brooks  1987-12-14          UK
3  229        Lori Ayala  1947-11-03         USA

In [23]:
df_movies = df[['movies_id','title', 'genre', 'release_year', 'studios_id']].drop_duplicates()
df_newMovies = df_movies.drop_duplicates()
df_newMovies.sort_values(['movies_id'])
df_newMovies = df_newMovies.rename(columns={'movies_id':'id'})
df_newMovies.to_sql('Movies', conn, if_exists='append', index=False)

    id                      title   genre  release_year  studios_id
0  186               Poor almost.   Drama          1992           7
1  185          Good wide office.   Drama          2013           6
2  182  Real responsibility kind.  Comedy          1996           9
3   44     Former player similar.  Action          2020           7

In [33]:
df_studios = df[['studios_id', 'studio_name', 'location']].drop_duplicates()
df_studios = df_studios.rename(columns={'studios_id':'id'})
df_studios.to_sql('Studios', conn, if_exists='append', index=False)

15

In [29]:
df_cast = df[['movies_id', 'actors_id', 'role']].drop_duplicates()
df_cast.to_sql('Cast', conn, if_exists='append', index=False)

1200